MyHome/src/InformationRegisters/ДанныеСеансовИнформационнойБазы/ДанныеСеансовИнформационнойБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеСеансовИнформационнойБазы</name>
  <resources>
    <name>ДатаНачалаСеанса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>НомерСоединения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяПолнофункциональныйИнтерфейс</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяМобильныйИнтерфейс</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

MyHome/src/InformationRegisters/ДанныеСеансовИнформационнойБазы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ЗаписатьДанныеСеанса(ДанныеСеанса) Экспорт
	
	Менеджер = РегистрыСведений.ДанныеСеансовИнформационнойБазы.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Менеджер, ДанныеСеанса);
	Менеджер.Записать();
	
КонецПроцедуры

Функция ДанныеСеанса(НомерСеанса, Данные = "") Экспорт
	
	Если ПустаяСтрока(Данные) Тогда
		Ключи = "НомерСеанса, ДатаНачалаСеанса, Пользователь, НомерСоединения, ИспользуетсяПолнофункциональныйИнтерфейс, ИспользуетсяМобильныйИнтерфейс";
	Иначе
		Ключи = Данные;
	КонецЕсли;
	
	СтруктураДанных = Новый Структура(Ключи);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерСеанса", НомерСеанса);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеСеансовИнформационнойБазы.НомерСеанса,
	|	ДанныеСеансовИнформационнойБазы.ДатаНачалаСеанса,
	|	ДанныеСеансовИнформационнойБазы.Пользователь,
	|	ДанныеСеансовИнформационнойБазы.НомерСоединения,
	|	ДанныеСеансовИнформационнойБазы.ИспользуетсяПолнофункциональныйИнтерфейс,
	|	ДанныеСеансовИнформационнойБазы.ИспользуетсяМобильныйИнтерфейс
	|ИЗ
	|	РегистрСведений.ДанныеСеансовИнформационнойБазы КАК ДанныеСеансовИнформационнойБазы
	|ГДЕ
	|	ДанныеСеансовИнформационнойБазы.НомерСеанса = &НомерСеанса";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти

#КонецЕсли
